app/controllers/messages_controller.rb

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "messages" ("body", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "年后"], ["user_id", 1], ["chat_id", 1], ["created_at", "2017-12-13 03:22:30.632893"], ["updated_at", "2017-12-13 03:22:30.632893"]]
---
  def create
    @message = current_user.messages.build(message_params)
    chat=Chat.find_by_id(params[:chat_room])
    redirect_to chats_path, flash: {:warning => '此聊天不存在'} and return if chat.nil?
    @message.chat=chat
    if @message.save

SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "messages" WHERE "messages"."chat_id" = ?  [["chat_id", 3]]
---
  def destroyall
    chat=Chat.find_by_id(params[:chat_room])
    chat.messages.delete_all