app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "sex", "password_digest", "phonenumber", "status", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user=User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = ?, "phonenumber" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$lyoF.FUvGQtHzCj3WifeT.mnFXmEcqAcr7wFYomF3sUtl1BgmSLky"], ["phonenumber", "18888888888"], ["updated_at", "2018-01-08 05:48:58.512645"], ["id", 104]]
---
  def update
    if current_user.role!=5
      if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE (users.name LIKE '%%') LIMIT 100 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (users.name LIKE '%%')
---
  def manage
      @users=User.search(params).paginate(:page => params[:page], :per_page => 1000)

SELECT  "users".* FROM "users" WHERE (users.name LIKE '%%') LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (users.name LIKE '%%')
---
  def index

    @users=User.search(params).paginate(:page => params[:page], :per_page => 10)